---
kind: method
id: M:Autodesk.Revit.DB.UnitUtils.GetAllUnits
source: html/4f31ee9d-8e33-a12a-14b3-cc565dd77d45.htm
---
# Autodesk.Revit.DB.UnitUtils.GetAllUnits Method

Gets the identifiers of all available units.

## Syntax (C#)
```csharp
public static IList<ForgeTypeId> GetAllUnits()
```

## Returns
The unit identifiers.